{
    "blogs": [
        {
            "tittle": "my first blog",
            "body": "Effect of reduced vision acuity on academic performance among secondary school students in South Nigeria by Ebikabowezi (2014). Reduced vision often results to in a low motivation to explore the environment initiate social interaction and manipulation of objects. In older children, refractive error is a frequent cause of reduced visual acuity. Refractive errors results due to an error in focusing of light by the eye. These errors may be to abnormal curvature of the cornea. Children with refractive errors and other visual impairments struggle in schools, straining to make out blurry images on the board, squinting to see classroom demonstrations and falling behind in every task like homework. He only focused on children with low vision and challenges they face in schools and not those in grade 5 in Primary schools however he was general to all the children \n In profile of vision function amongst learners with low vision attending inclusive schools in Kakamega County Kenya Ashioya and Clarke-Farr 2021 The quality of vision function of low vision children determines their ease and success in performing activities of daily living including academic activities undertaken whilst in school Although vision plays an important role in academic performance low vision influence learners participation in activities in inclusive school The part that inform their comfort ability in the inclusive schools environment should be assessed before these learners are placed into the mainstream school. They did not focus on the public normal schools since the inclusive schools are adapted and also they did not focus on those in grade 5.",
            "author": "Marioo",
            "id": 1
        },
        {
            "tittle": "oppenning party!",
            "body": "Effect of reduced vision acuity on academic performance among secondary school students in South Nigeria by Ebikabowezi (2014). Reduced vision often results to in a low motivation to explore the environment, initiate social interaction and manipulation of objects. In older children, refractive error is a frequent cause of reduced visual acuity. Refractive errors results due to an error in focusing of light by the eye. These errors may be to abnormal curvature of the cornea. Children with refractive errors and other visual impairments struggle in schools, straining to make out blurry images on the board, squinting to see classroom demonstrations and falling behind in every task like homework. He only focused on children with low vision and challenges they face in schools and not those in grade 5 in Primary schools however he was general to all the children.In profile of vision function amongst learners with low vision attending inclusive schools in Kakamega County, Kenya (Ashioya and Clarke-Farr 2021). The quality of vision function of low vision children determines their ease and success in performing activities of daily living including academic activities undertaken whilst in school. Although vision plays an important role in academic performance, low vision influence learners participation in activities in inclusive school. The part that inform their comfort ability in the inclusive school’s environment should be assessed before these learners are placed into the mainstream school. They did not focus on the public normal schools since the inclusive schools are adapted and also they did not focus on those in grade 5.",
            "author": "Yoshi",
            "id": 2
        }
    ]
    
}